let checkConsole = document.getElementById("chc")
let num = 1
setInterval(() => {
  checkConsole.style.fontSize = `${num++}px`
}, 100)

//---------------------------------------------------------------------
let nums = [1, 3, 5, 7, 9, 10, 12, 14, 16, 18, 20]

nums.forEach(function (num, index) {
 console.log(`number ${index + 1} : ${num}`)
})

let filtredNumbers = nums.filter(num => num > 9)
console.log(filtredNumbers)

function getUserInfo(userName) {
 let isLogin = false

 if (userName.toLowerCase() === "mohammadiko") {
  isLogin = true
 }

 return () => {
  console.log("این تابع نشون میده که یوزر لاگین کرده")
 }
}

console.log(getUserInfo("mohammadiko"));
console.log(getUserInfo("mohammadiko")());

//---------------------------------------------------------------------

// توضیحات
// تو جلسه قبل گفتیم که تابعی پیور به حساب میاد که برای هر ورودی فقط فقط یک خروجی مختص همون برای ما داشته باشه و برای محاسبه یا ریترن کردن یک خروجی فقط از ورودی هودش و از وریبل های لوکال داخلی استفاده کرده باشه  ن از ریسپانسی ن از وریبل های گلوبال یا خارجی
// و گفتیم شرط سوم برای خالص بودن اینکه این تابع موقع اجرا ساید افکت نداشته باشه دیتا های خارج از خودش برای ما تغییر نده
// به عنوان مثال اگر تابع موقع موقع اجرا شدن یک اطلاعاتی از دام رو تغییر بده یک اینپوتی یا  ولیو و استایلش رو چنجش کرده باشه همچین تابعی خالص نیست و میگن امپیور و تابع نا خالص
//----------------------------------------
// تابعی که یک ورودی به عنوان تابع بگیره یا بع عنوان خروجی یک تابع ای رو به ما بده اون میشه هایر اوردر فانکشن higher order function
// اگر تابعی توی ورودی خودش یک کال بک بگیره یا یک تابعی رو به عنوان خروجی ریترن کنه این میشه تابع هایر اوردر 