import React, { useEffect, useLayoutEffect, useState } from 'react'

export default function App9() {

 const [divStyle , setDivStyle] = useState({})
 const [num , setNum] = useState(1)

//  useEffect(() => {

//   const randint = Math.floor(Math.random() * 516)

//   for (let i = 0; i < 100_000_001 ; i++){
//    if (i === 100_000_000){
//     console.log("for repeating 100,000,000")
//     setDivStyle({paddingTop: `${randint}px`})
//    }
//   }
//  } , [num])

 useLayoutEffect(() => {

  const randint = Math.floor(Math.random() * 516)

  for (let i = 0; i < 100_000_001 ; i++){
   if (i === 100_000_000){
    console.log("for repeating 100,000,000")
    setDivStyle({paddingTop: `${randint}px`})
   }
  }
 } , [num])

  return (
    <div style={divStyle} className='dfcjac g1 ac'>
     <span> {num} </span>
     <button className='w2-5 h2-5 br10 bnone bg-primary cwhite' onClick={() => setNum(prevNum => prevNum + 1)}>+</button>
     <button className='w2-5 h2-5 br10 bnone bg-danger cwhite' onClick={() => setNum(prevNum => prevNum - 1)}>-</button>
    </div>
  )
}

// توضیحات 1:35 14:35
// هوک یوزافکت یک هوکی که اگه بهش یک کال بک بدیم حالا همراه به دپندنسی هایی که میخایم اون کال بک ما برای ما به شکل اسینک رو نس و زمانبر و نا همگام اجرا میشه یعنی اگر ما توی یوز افکت یک کال بک داشته باشیم که موقع کانپوننت دید اپدیت واسمون اجرا بشه به محض اینکه استیتی برای ما چنج بشع این واسمون اجرا میشه چونکه اسینکه رندر شدن دام برای ما منتظر یوز افکت نمیمونه و ممکنه دام برای ما زودتر از چنج شدن یوز افکت اجرا بشه و ری رندر بشه یعنی ما میخایم توی یوز افکت یک عملکرده داشته باشیم که مثلا ریکوعست به سمت یک ای پی ای و این عملکرد ایسینک و زمانبر به حساب میاد 
// تفاوت بین افکت و لیاوت افکت اینکه یوزافکت یک هوکیه که به شکل اسینک و زمانبر و نا همگام اون کالبکش رو اجرا میکنه و اگر ما داخلش یک عملکرد ایسینک هم خودمون داشه باشیم دیگه واویلا - قبل از اینکه این کارما برای ما انجام بشه و اون استیت که ما میخایم چنج بشه اون تغییراتی رو توی دام اجرا میشه یعنی العان قبل از اینکه اعمال بشه این نامبر واسمون تغییرش اعمال میشه یعنی نامبر منتظر اعمال پدینگ نمیمونه 
// عمدتا زمانی استفاده میشه ازش که ما بخایم توی این افکت یک عملکرد  راجب خود استایل ها و محل قرار گیری رنگ در کل راجب خود اون المنت ها بخایم یک عملکرد داشته باشیم مثل همین  ست استایل پدینگ پس استفاده مکرر باعث پایین امدن  پرفورمنس میشه
// خود سازنده ها گفتن که و اگر ایحانا نیازی به صرفا به این موضوع داشتین اون موقع بیاین از لیاوت افکت استفاده کرده باشید  و اگر ن همیشه توی اولویت همون افکت خالی رو قرار بدیم 